#ifndef _BASECORE_COMMON_GAME_MSGCONSTDEFINE_H_
#define _BASECORE_COMMON_GAME_MSGCONSTDEFINE_H_

const int MSG_LOGIN_GAME_ZOON_LIST = 0x060124;
const int MSG_LOGOUT_INFO = 0x020104; //用户退出确认消息
const int MSG_LOGON_REFUSE = 0x000003; //拒绝登录消息
const int MSG_RES_VERSION_STATUS = 0x020109; //资源版本信息
const int MSG_SERVER_IP = 0x120103; //游戏服务器地址通知

//通用消息返回
const int MSG_LOGON_FLASH_MESSAGE = 0x010109; //登录闪报
const int MSG_FLASH_MESSAGE = 0x010209; //群发闪报

/*****************************************************************************************************************************
											LoginScene****登陆界面消息*****start******
******************************************************************************************************************************/
//------------普通消息返回------------
const int MSG_LOGON_PROFILE = 0x020102; //登陆成功响应消息,里面有个人信息和版本信息

//------------通用消息返回------------
const int MSG_LOGON_INFO = 0x020101; //登录失败返回消息
/*****************************************************************************************************************************
											LoginScene****登陆界面消息*****end******
******************************************************************************************************************************/



/*****************************************************************************************************************************
											LobbyScene****大厅界面消息*****start******
******************************************************************************************************************************/
//好友列表BuddyList
const int MSG_BUDDY_INFO_RESP = 0x01013E;

//------------普通消息返回------------

const int MSG_GAME_ZOON_LIST = 0x060124;//房间列表信息

//------------通用消息返回------------

//------------******************------------比赛消息----------******************----------------

//------------普通消息返回------------

//2.7.2.返回即时比赛列表(IMatchListResp)
const int MSG_IMatchListResp = 0x060229;

//2.7.4.返回即时比赛详情(IMatchInfoResp)
const int MSG_IMatchInfoReq = 0x06022B;

//2.7.7.报名人数变更通知(IMatchSignupNotify)
const int MSG_IMatchSignupNotify = 0x06022E;

//2.7.8.玩家当前比赛状态信息(ImatchPlayerStatus)
const int MSG_ImatchPlayerStatus = 0x06022F;

//2.7.33.报名|退赛回执 (IMatchSignupResp)
const int MSG_IMatchSignupResp =0x060234;

//------------通用消息返回------------


/*****************************************************************************************************************************
											LobbyScene****大厅界面消息*****end******
******************************************************************************************************************************/



/*****************************************************************************************************************************
											GameScene****游戏界面消息*****start******
******************************************************************************************************************************/
//------------普通消息返回------------
//游戏商店商品列表
const int MSG_STORE_MAGIC_LIST = 0x110B02;
//游戏可出售列表
const int MSG_STORE_CANSALE_LIST = 0x110B07;
//购买道具回复
const int MSG_BUY_MAGIC_RESP = 0x110302;
//批量出售道具回复
const int MSG_SALEALLPROP_RESP = 0x110306;

//------------通用消息返回------------

//------------******************------------比赛消息----------******************----------------
//------------普通消息返回------------
//2.7.10.比赛游戏对局结束 IMatchGameOver
const int MSG_MatchGameOver = 0x060231;

//2.7.11.比赛轮空通知（IMatchBye）
const int MSG_IMatchBye = 0x060232;

//2.8.11.比赛游戏开局IMatchAntilordStart
const int MSG_IMatchAntilordStart = 0x070115;

//2.8.12.比赛游戏恢复现场ImatchAntilordResume
const int MSG_ImatchAntilordResume = 0x070116;

//2.7.28.玩家比赛成绩(MatchPerformance)
const int MSG_MatchPerformance = 0x060203;

//------------通用消息返回------------

/*****************************************************************************************************************************
											GameScene****游戏界面消息*****end******
******************************************************************************************************************************/


/*****************************************************************************************************************************
											GlobleMsg****全局消息*****start******
******************************************************************************************************************************/
//------------普通消息返回------------
const int MSG_RECOVERY_GAME_NOTIY = 0x06013a;	//恢复对局通知
const int MSG_GAME_RESUME = 0x070117; //恢复对局响应

const int MSG_OPEN_MONEY_BOX_RESP = 0x01013D;//开奖励宝箱结果
const int MSG_PLAY_BOX_LIST = 0x01013E;//道具宝箱列表

//------------通用消息返回------------
const static int MSG_ENTER_GAME = 0x060104;//开局失败通用返回
const static int MSG_GENNAL_OTHER_LOGIN = 0x000000;//账号在别处登陆

//------------******************------------比赛消息----------******************----------------
//------------普通消息返回------------

//------------通用消息返回------------
//比赛报名通用消息返回
const static int MSG_IMatchSignup = 0x06022c;

/*****************************************************************************************************************************
											GlobleMsg****全局消息*****end******
******************************************************************************************************************************/

#endif /* _BASECORE_COMMON_GAME_MSGCONSTDEFINE_H_ */
